---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PlumbingFixturesSupplyPipe
source: html/fb781aa6-1ff9-b279-a64d-870d84ff1353.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PlumbingFixturesSupplyPipe Property

"Supply Pipe"

## Syntax (C#)
```csharp
public static ForgeTypeId PlumbingFixturesSupplyPipe { get; }
```